busworkbackend/busworkbackend/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'crentsilkwayie@gmail.com'
 LIMIT 1
INSERT INTO `users` (`email`, `name`, `password`, `id`, `created_at`, `updated_at`) VALUES ('testuser@example.com', 'Test User', '$2y$10$68xZusZQX0sgpNyU8T0SzeQIbPXrh3FfM53MjrOGu.wVC9kp35akW', '663cea6ba0ef3', '2024-05-09 15:23:23', '2024-05-09 15:23:23')
---
    public function login()
    {
        $userModel = new UserModel();
        $data = $this->request->getJSON(true);

        log_message('debug', 'Login Request Data: ' . json_encode($data));

        $email = $data['email'] ?? '';
        $password = $data['password'] ?? '';

        log_message('debug', 'Email: ' . $email . ', Password: ' . $password);

        $user = $userModel->where('email', $email)->first();

        log_message('debug', 'User Fetched: ' . json_encode($user));

        if (!$user) {
            log_message('debug', 'User not found');
            return $this->failUnauthorized('Invalid login credentials.');
        }

        if ($password !== $user['password']) {
            log_message('debug', 'Password Verification Failed');
            return $this->failUnauthorized('Invalid login credentials.');
        }

        $token = $this->authLibrary->createToken($user['email'], $user['id']);

INSERT INTO `users` (`email`, `name`, `password`, `role`, `id`, `created_at`, `updated_at`) VALUES ('crentsilk788wayie@gmail.com', 'Alan', '12345678', 'admin', '66434da81d9e0', '2024-05-14 11:40:24', '2024-05-14 11:40:24')
---
    public function register()
    {
        $userModel = new UserModel();
        $data = $this->request->getJSON(true);

        log_message('debug', 'Register Request Data: ' . json_encode($data));

        if (!isset($data['password'])) {
            return $this->failValidationErrors(['password' => 'The password field is required.']);
        }

        if (!isset($data['role'])) {
            return $this->failValidationErrors(['role' => 'The role field is required.']);
        }

        // Ensure the role is set and is either 'user' or 'admin'
        $data['role'] = $data['role'];
        if (!in_array($data['role'], ['user', 'admin'])) {
            return $this->failValidationErrors(['role' => 'Invalid role specified.']);
        }

        $data['id'] = uniqid();
        $data['password'] = $data['password']; // Ensure password is plain text for now

        log_message('debug', 'Password set to plaintext: ' . $data['password']);
        log_message('debug', 'Role set to: ' . $data['role']);

        if ($userModel->insert($data)) {