busworkbackend/busworkbackend/app/Controllers/BusController.php

SELECT *
FROM `schedule`
---
    public function getBusSchedule(): ResponseInterface
    {
        $schedules = $this->scheduleModel->findAll();

SELECT *
FROM `conductor`
---
    public function getAllConductors(): ResponseInterface
    {
        $conductors = $this->conductorModel->findAll();