busworkbackend/busworkbackend/app/Filters/AdminGuard.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getHeader('Authorization');
        if ($authHeader && preg_match('/Bearer\s(\S+)/', $authHeader->getValue(), $matches)) {
            $token = $matches[1];
            $user = $this->authLibrary->validateToken($token);
            if ($user) {
                $userData = $this->userModel->find($user['id']);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 'admin-uuid'