busworkbackend/busworkbackend/app/Libraries/AuthLibrary.php

SELECT *
FROM `users`
WHERE `users`.`id` = '66434e72e6617'
---
    public function getCurrentUser($userId)
    {
        return $this->userModel->find($userId);