busworkbackend/busworkbackend/app/Services/OrdersService.php

    public function createOrder($scheduleId, $ticketQuantity, $userId)
    {
        $schedule = $this->scheduleModel->find($scheduleId);

        if (!$schedule) {
            throw new HTTPException('Bus timing does not exist', 500);
        }

        $orderData = [
            'id' => Uuid::uuid4()->toString(),
            'amount' => $schedule['ticketPrice'] * $ticketQuantity,
            'receipt' => Uuid::uuid4()->toString(),
            'scheduleId' => $scheduleId,
            'attempts' => 0,
            'created_at' => date('Y-m-d H:i:s'),
            'status' => 'pending',
            'userId' => $userId,
        ];

        // Store order in the database
        $this->orderModel->insert($orderData);
---
SELECT *
FROM `schedule`
WHERE `schedule`.`id` = 'schedule-1'
INSERT INTO `order` (`id`, `amount`, `receipt`, `scheduleId`, `attempts`, `created_at`, `status`, `userId`, `updated_at`) VALUES ('8b9905cc-385f-4fd4-9054-0779e58f7729', 1000, '9a29dea7-a4b1-4247-ade5-4e077a440770', 'schedule-1', 0, '2024-05-14 16:22:54', 'pending', '6643854', '2024-05-14 16:22:54')

    public function getAllOrders()
    {
        return $this->orderModel->findAll();
---
SELECT *
FROM `order`

    public function updateOrder($id, $data)
    {
        $order = $this->orderModel->find($id);
---
SELECT *
FROM `order`
WHERE `order`.`id` = '{b6e9dd57-8bd3-448c-a951-4442072fb500}'